# Маленький проект онлайн маркетплейс
# Видение проекта:

# Интернет-магазин должен иметь меню:

# 1. Главная страница:
#    1. Будет составлять топ 5 товаров по продаваемости на сайте
#    2. Функционал добавления топ 5 товаров из главной страницы
#    3. Функционал перехода на другие страницы их 3 всего
#
# 2. Страница категорий:
#    1. Показ категорий перечисление из ассортимента для выбора:
#         1. smartphones
#         2. laptops
#         3. computers
# 2. Показ категории для выбора по умолчанию: smartphones
#    1. показ самих элементов smartphones для показа
#    2. Функционал добавления самих вещей в корзину
#    3. Функционал для принятия вывода других категорий по выбору пользователя
#    4. Функционал для перехода на другую страницу

# 3. Страница поиска
# 4. Страница корзины

# Каждый товар имеет следующие характеристики:
# - уникальный ключ;
# - категория;
# - является ли товар топом продаж;
# - название;
# - цену;
# - количество.

# ---------------------- Version 0.1 ----------------------------